<script>
import axios from "axios";
import { API_URL } from "../../main";

export default {
  data() {
    return {
      persons: {
        sale: {
          id: 0,
          name: '',
          surname: '',
          job: '',
          department: '',
          attachment: {
            id: 0,
            name: '',
            origin_name: '',
            url: '',
          }
        },
        credit: {
          id: 0,
          name: '',
          surname: '',
          job: '',
          department: '',
          attachment: {
            id: 0,
            name: '',
            origin_name: '',
            url: '',
          }
        }
      },
      vacancies: [
        {
          id: 0,
          title: '',
          description: '',
          requirements: '',
          conditions: '',
          min: '',
          max: '',
        }
      ],
      settings: [
        {
          id: 0,
          description: '',
          value: '',
          extra: '',
          name: '',
          active: false,
        }
      ],
      active: false,
    }
  },
  methods: {
    async getSalePersons() {
      try {
        const params = {};
        params.department = 1;
        const response = await axios.get(`${API_URL}/api/persons`, {params});
        const { data: { data: list } } = response;

        this.persons.sale = list;
      } catch (e) {
        console.log(e)
      }
    },
    async getCreditPersons() {
      try {
        const params = {};
        params.department = 2;
        const response = await axios.get(`${API_URL}/api/persons`, {params});
        const { data: { data: list } } = response;

        this.persons.credit = list;
      } catch (e) {
        console.log(e)
      }
    },
    async getVacancies() {
      try {
        const response = await axios.get(`${API_URL}/api/vacancies`);
        const { data } = response;

        this.vacancies = data;
      } catch (e) {
        console.log(e);
      }
    },
    async getAbout() {
      try {
        const response = await axios.get(`${API_URL}/api/settings/about`);
        const { data: { data: list } } = response;

        this.settings = list;
      } catch (e) {
        console.log('ABOUT', e);
      }
    }
  },
  mounted() {
    this.getSalePersons();
    this.getCreditPersons();
    this.getVacancies();
    this.getAbout();
  }
}
</script>

<template>
  <main class="main">
    <div class="wrapper">
      <section class="pagination-pages about-pagination">
        <router-link to="/">Главная</router-link>
        <div class="pagination-slesh">/</div>
        <div class="currentPage">О компании</div>
      </section>
      <section class="about">
        <section class="about_header">
          <h1>о компании</h1>
          <p>ООО “Альянс Моторс” работает на автомобильном рынке г. Краснодара<span> с 2010 г.</span></p>
        </section>
        <section class="about_grid">
          <ul class="about_grid-1">
            <li>
              <picture>
                <source srcset="@img/about.png" type="image/webp">
                <img src="@img/about.png" alt="About" />
              </picture>
            </li>
            <li>
              <p>С начала своей деятельности компания развивала два направления: продажи и обслуживание новых автомобилей LADA и направление продажи автомобилей с пробегом. <br /><br />С 2017 г. Компания переориентировала все силы на продажи автомобилей с пробегом.</p>
            </li>
          </ul>
          <ul class="about_grid-2">
            <li>За время своей деятельности ООО «Альянс Моторс» заработала на рынке продаж автомобилей с пробегом репутацию надежного партнера и заняла лидирующие позиции.<br /><br />Сегодня, имея успешный опыт, как в работе с новыми автомобилями, так и с автомобилями с пробегом, компания «Альянс Моторс» стремится развиваться и ищет новые направления своей деятельности.</li>
            <li>
              <div class="flex column">
                <svg xmlns="http://www.w3.org/2000/svg" width="191" height="72" viewBox="0 0 191 72" fill="none">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M61.3335 71.1239L72.8529 68.052C73.0891 67.9891 73.2846 67.8236 73.3857 67.6011L81.845 48.9907C82.0755 48.4835 82.7353 48.3512 83.1436 48.7303L94.4809 59.2579C94.7941 59.5487 95.2786 59.5487 95.5919 59.2579L106.961 48.701C107.36 48.3305 108.003 48.4471 108.246 48.9341L117.595 67.6314C117.697 67.836 117.881 67.9883 118.101 68.0512L128.706 71.0813C129.387 71.2759 129.976 70.5702 129.662 69.935L95.7684 1.27772C95.4689 0.671099 94.6039 0.671099 94.3044 1.27772L60.3912 69.9738C60.0806 70.6028 60.6557 71.3046 61.3335 71.1239ZM93.9023 24.5813L86.9261 38.7043C86.7178 39.1259 86.8038 39.6335 87.1394 39.963L94.41 47.1018C94.8491 47.533 95.5582 47.5145 95.9744 47.0611L102.498 39.9544C102.799 39.6262 102.87 39.1475 102.676 38.7461L95.8588 24.5911C95.4653 23.7741 94.3039 23.7683 93.9023 24.5813Z" fill="#333333"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M108.038 16.7849L122.142 2.68076C122.244 2.5787 122.383 2.52136 122.527 2.52136H189.456C189.941 2.52136 190.184 3.10667 189.842 3.44976L181.869 11.449C181.767 11.5515 181.628 11.609 181.483 11.609H126.545C126.401 11.609 126.263 11.6659 126.161 11.7672L112.621 25.2231C112.358 25.4848 111.916 25.4119 111.751 25.0795L107.936 17.4121C107.832 17.2027 107.873 16.9502 108.038 16.7849ZM127.68 14.9448L113.842 28.7895C113.678 28.9528 113.636 29.2014 113.736 29.4097L117.743 37.7598C117.825 37.9296 118.05 37.9673 118.182 37.8333L139.115 16.6386C139.794 15.951 139.307 14.7853 138.34 14.7853H128.065C127.921 14.7853 127.782 14.8427 127.68 14.9448ZM137.749 22.8026L145.451 15.1039C145.655 14.8999 145.932 14.7853 146.221 14.7853H177.263C177.748 14.7853 177.991 15.3735 177.646 15.7158L169.625 23.6766C169.521 23.7802 169.379 23.8372 169.232 23.8345L137.936 23.2671C137.696 23.2628 137.579 22.9723 137.749 22.8026ZM133.096 27.466L126.149 34.5884C125.813 34.9332 126.058 35.5126 126.539 35.5126H157.392C157.535 35.5126 157.671 35.4569 157.773 35.3573L165.32 27.9703C165.669 27.6286 165.426 27.0356 164.937 27.0372L133.872 27.1375C133.58 27.1384 133.3 27.2568 133.096 27.466Z" fill="#B40D16"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M81.9636 16.7849L67.8595 2.68076C67.7575 2.5787 67.619 2.52136 67.4747 2.52136H0.54586C0.0614471 2.52136 -0.181557 3.10667 0.160408 3.44976L8.13321 11.449C8.23532 11.5515 8.37402 11.609 8.51867 11.609H63.457C63.6008 11.609 63.7387 11.6659 63.8407 11.7672L77.3805 25.2231C77.6438 25.4848 78.086 25.4119 78.2514 25.0795L82.0661 17.4121C82.1702 17.2027 82.129 16.9502 81.9636 16.7849ZM62.3217 14.9448L76.1603 28.7895C76.3236 28.9528 76.366 29.2014 76.266 29.4097L72.2587 37.7598C72.1772 37.9296 71.9521 37.9673 71.8198 37.8333L50.8872 16.6386C50.2081 15.951 50.6952 14.7853 51.6616 14.7853H61.9368C62.0812 14.7853 62.2197 14.8427 62.3217 14.9448ZM52.2533 22.8026L44.5508 15.1039C44.3467 14.8999 44.0699 14.7853 43.7813 14.7853H12.7393C12.2535 14.7853 12.0111 15.3735 12.3559 15.7158L20.3765 23.6766C20.4809 23.7802 20.6227 23.8372 20.7698 23.8345L52.0658 23.2671C52.3059 23.2628 52.4231 22.9723 52.2533 22.8026ZM56.9059 27.466L63.8525 34.5884C64.1887 34.9332 63.9444 35.5126 63.4629 35.5126H32.6097C32.4674 35.5126 32.3307 35.4569 32.229 35.3573L24.6822 27.9703C24.3331 27.6286 24.5762 27.0356 25.0647 27.0372L56.1302 27.1375C56.4224 27.1384 56.7019 27.2568 56.9059 27.466Z" fill="#B40D16"/>
                </svg>
                <svg xmlns="http://www.w3.org/2000/svg" width="190" height="16" viewBox="0 0 190 16" fill="none">
                  <path d="M0.444584 14.7787C0.030661 14.5948 -0.0942296 14.2896 0.0699123 13.863L5.30461 0.922863C5.45448 0.562493 5.70783 0.382308 6.06466 0.382308H6.11819C6.46788 0.389663 6.71052 0.569848 6.84612 0.922863L12.1129 13.863C12.2913 14.2896 12.17 14.5948 11.749 14.7787C11.335 14.9478 11.0424 14.8228 10.8712 14.4036L9.54375 11.1272H2.63909L1.32239 14.4036C1.15824 14.8302 0.865644 14.9552 0.444584 14.7787ZM3.18504 9.7372H8.9764L6.06466 2.57762L3.18504 9.7372Z" fill="#333333"/>
                  <path d="M15.5992 14.8449C15.1496 14.8449 14.9248 14.6132 14.9248 14.1499V1.07731C14.9248 0.613975 15.1496 0.382308 15.5992 0.382308C16.0488 0.382308 16.2736 0.613975 16.2736 1.07731V13.4549H22.5895C23.0391 13.4549 23.2639 13.6865 23.2639 14.1499C23.2639 14.6132 23.0391 14.8449 22.5895 14.8449H15.5992Z" fill="#333333"/>
                  <path d="M26.5968 14.8449C26.1472 14.8449 25.9224 14.6132 25.9224 14.1499V1.07731C25.9224 0.613975 26.1472 0.382308 26.5968 0.382308C27.0464 0.382308 27.2712 0.613975 27.2712 1.07731V13.4549H33.5871C34.0367 13.4549 34.2615 13.6865 34.2615 14.1499C34.2615 14.6132 34.0367 14.8449 33.5871 14.8449H26.5968Z" fill="#333333"/>
                  <path d="M37.5945 14.8449C37.3804 14.8449 37.2126 14.786 37.0913 14.6684C36.9771 14.5433 36.92 14.3705 36.92 14.1499V1.07731C36.92 0.849319 36.9771 0.676488 37.0913 0.558816C37.2126 0.441144 37.3804 0.382308 37.5945 0.382308C37.8157 0.382308 37.9834 0.441144 38.0976 0.558816C38.2118 0.676488 38.2689 0.849319 38.2689 1.07731V14.1499C38.2689 14.3705 38.2118 14.5433 38.0976 14.6684C37.9834 14.786 37.8157 14.8449 37.5945 14.8449Z" fill="#333333"/>
                  <path d="M41.4661 14.7787C41.0522 14.5948 40.9273 14.2896 41.0914 13.863L46.3261 0.922863C46.476 0.562493 46.7294 0.382308 47.0862 0.382308H47.1397C47.4894 0.389663 47.7321 0.569848 47.8677 0.922863L53.1345 13.863C53.3129 14.2896 53.1916 14.5948 52.7705 14.7787C52.3566 14.9478 52.064 14.8228 51.8927 14.4036L50.5653 11.1272H43.6606L42.3439 14.4036C42.1798 14.8302 41.8872 14.9552 41.4661 14.7787ZM44.2066 9.7372H49.9979L47.0862 2.57762L44.2066 9.7372Z" fill="#333333"/>
                  <path d="M56.6208 14.8449C56.1711 14.8449 55.9463 14.6132 55.9463 14.1499V1.07731C55.9463 0.613975 56.1711 0.382308 56.6208 0.382308C56.8563 0.382308 57.0846 0.518366 57.3059 0.790482L66.2231 12.6054H65.9019V1.07731C65.9019 0.613975 66.1267 0.382308 66.5763 0.382308C67.0259 0.382308 67.2507 0.613975 67.2507 1.07731V14.1499C67.2507 14.6132 67.0259 14.8449 66.5763 14.8449C66.3337 14.8449 66.1053 14.7088 65.8912 14.4367L56.974 2.62174H57.2952V14.1499C57.2952 14.6132 57.0704 14.8449 56.6208 14.8449Z" fill="#333333"/>
                  <path d="M75.6044 14.8449C74.0272 14.8449 72.8711 14.4661 72.136 13.7086C71.4009 12.9511 71.0334 11.7597 71.0334 10.1343V5.09285C71.0334 3.4528 71.4009 2.2577 72.136 1.50754C72.8711 0.750033 74.0201 0.374954 75.583 0.382308H78.1736C79.501 0.382308 80.4965 0.665456 81.1602 1.23175C81.824 1.79069 82.1951 2.69161 82.2736 3.93452C82.3021 4.16251 82.2593 4.33901 82.1451 4.46404C82.0309 4.58907 81.8596 4.65158 81.6313 4.65158C81.2173 4.65158 80.9818 4.41991 80.9247 3.95658C80.8676 3.11817 80.6286 2.54452 80.2075 2.23563C79.7936 1.92675 79.1156 1.7723 78.1736 1.7723H75.583C74.7837 1.76495 74.1521 1.86423 73.6882 2.07016C73.2243 2.27608 72.8889 2.62174 72.682 3.10714C72.4821 3.59253 72.3822 4.25444 72.3822 5.09285V10.1343C72.3822 10.958 72.4821 11.6126 72.682 12.098C72.8889 12.5834 73.2279 12.9327 73.6989 13.146C74.1699 13.3519 74.8051 13.4549 75.6044 13.4549H78.1736C79.1156 13.4549 79.7936 13.3004 80.2075 12.9916C80.6286 12.6753 80.8676 12.1017 80.9247 11.2706C80.9818 10.8073 81.2173 10.5756 81.6313 10.5756C81.8596 10.5756 82.0309 10.6381 82.1451 10.7631C82.2593 10.8808 82.3021 11.0573 82.2736 11.2927C82.1951 12.5282 81.824 13.4291 81.1602 13.9954C80.4965 14.5617 79.501 14.8449 78.1736 14.8449H75.6044Z" fill="#333333"/>
                  <path d="M86.5401 14.8449C86.0905 14.8449 85.8657 14.6132 85.8657 14.1499V1.07731C85.8657 0.613975 86.0905 0.382308 86.5401 0.382308H94.4511C94.9007 0.382308 95.1255 0.613975 95.1255 1.07731C95.1255 1.54064 94.9007 1.7723 94.4511 1.7723H87.2145V6.83586H91.9247C92.3743 6.83586 92.5991 7.06753 92.5991 7.53086C92.5991 7.99419 92.3743 8.22585 91.9247 8.22585H87.2145V13.4549H94.4511C94.9007 13.4549 95.1255 13.6865 95.1255 14.1499C95.1255 14.6132 94.9007 14.8449 94.4511 14.8449H86.5401Z" fill="#333333"/>
                  <path d="M108.937 15.026C108.487 15.026 108.262 14.7943 108.262 14.331V1.25842C108.262 0.795091 108.487 0.563425 108.937 0.563425C109.251 0.563425 109.504 0.714192 109.697 1.01573L114.932 9.22332L114.632 9.26744L119.888 1.01573C120.073 0.714192 120.345 0.563425 120.701 0.563425C121.087 0.563425 121.28 0.795091 121.28 1.25842V14.331C121.28 14.7943 121.055 15.026 120.605 15.026C120.156 15.026 119.931 14.7943 119.931 14.331V2.64842L120.338 2.79183L115.542 10.2382C115.349 10.5398 115.078 10.6905 114.728 10.6905C114.45 10.6905 114.214 10.5398 114.022 10.2382L109.226 2.79183L109.611 2.92421V14.331C109.611 14.7943 109.386 15.026 108.937 15.026Z" fill="#333333"/>
                  <path d="M129.635 15.026C128.058 15.026 126.902 14.6472 126.166 13.8897C125.431 13.1322 125.064 11.9408 125.064 10.3155V5.26293C125.064 3.62288 125.431 2.42778 126.166 1.67763C126.909 0.920117 128.061 0.548716 129.624 0.563425H132.204C133.788 0.563425 134.945 0.942182 135.672 1.69969C136.408 2.44985 136.775 3.64127 136.775 5.27396V10.3155C136.775 11.9408 136.408 13.1322 135.672 13.8897C134.945 14.6472 133.788 15.026 132.204 15.026H129.635ZM129.635 13.636H132.204C133.01 13.636 133.646 13.533 134.11 13.3271C134.581 13.1138 134.916 12.7645 135.116 12.2791C135.323 11.7937 135.426 11.1392 135.426 10.3155V5.27396C135.426 4.45026 135.323 3.79572 135.116 3.31032C134.916 2.82493 134.581 2.47927 134.11 2.27334C133.646 2.06006 133.01 1.95342 132.204 1.95342H129.624C128.825 1.94607 128.19 2.04535 127.719 2.25128C127.255 2.4572 126.919 2.80286 126.712 3.28826C126.513 3.77365 126.413 4.43188 126.413 5.26293V10.3155C126.413 11.1392 126.513 11.7937 126.712 12.2791C126.919 12.7645 127.258 13.1138 127.729 13.3271C128.2 13.533 128.836 13.636 129.635 13.636Z" fill="#333333"/>
                  <path d="M143.872 15.037C143.658 15.037 143.49 14.9782 143.369 14.8605C143.255 14.7355 143.198 14.5627 143.198 14.342V1.95342H138.777C138.563 1.95342 138.395 1.89459 138.274 1.77691C138.159 1.65189 138.102 1.47906 138.102 1.25842C138.102 1.03779 138.159 0.868637 138.274 0.750966C138.395 0.625939 138.563 0.563425 138.777 0.563425H148.968C149.182 0.563425 149.346 0.625939 149.46 0.750966C149.582 0.868637 149.642 1.03779 149.642 1.25842C149.642 1.47906 149.582 1.65189 149.46 1.77691C149.346 1.89459 149.182 1.95342 148.968 1.95342H144.547V14.342C144.547 14.5553 144.486 14.7245 144.365 14.8495C144.25 14.9745 144.086 15.037 143.872 15.037Z" fill="#333333"/>
                  <path d="M155.54 15.026C153.963 15.026 152.807 14.6472 152.072 13.8897C151.336 13.1322 150.969 11.9408 150.969 10.3155V5.26293C150.969 3.62288 151.336 2.42778 152.072 1.67763C152.814 0.920117 153.966 0.548716 155.529 0.563425H158.109C159.693 0.563425 160.85 0.942182 161.577 1.69969C162.313 2.44985 162.68 3.64127 162.68 5.27396V10.3155C162.68 11.9408 162.313 13.1322 161.577 13.8897C160.85 14.6472 159.693 15.026 158.109 15.026H155.54ZM155.54 13.636H158.109C158.916 13.636 159.551 13.533 160.015 13.3271C160.486 13.1138 160.821 12.7645 161.021 12.2791C161.228 11.7937 161.331 11.1392 161.331 10.3155V5.27396C161.331 4.45026 161.228 3.79572 161.021 3.31032C160.821 2.82493 160.486 2.47927 160.015 2.27334C159.551 2.06006 158.916 1.95342 158.109 1.95342H155.529C154.73 1.94607 154.095 2.04535 153.624 2.25128C153.16 2.4572 152.824 2.80286 152.617 3.28826C152.418 3.77365 152.318 4.43188 152.318 5.26293V10.3155C152.318 11.1392 152.418 11.7937 152.617 12.2791C152.824 12.7645 153.163 13.1138 153.634 13.3271C154.105 13.533 154.741 13.636 155.54 13.636Z" fill="#333333"/>
                  <path d="M175.805 15.0591C175.627 15.1694 175.455 15.2025 175.291 15.1584C175.134 15.1216 174.999 15.015 174.884 14.8385L171.437 9.10197H167.819V14.331C167.819 14.7943 167.594 15.026 167.145 15.026C166.695 15.026 166.47 14.7943 166.47 14.331V1.25842C166.47 0.795091 166.695 0.563425 167.145 0.563425H172.155C173.404 0.563425 174.353 0.898055 175.002 1.56731C175.652 2.23657 175.976 3.21471 175.976 4.50175V5.16365C175.976 6.28888 175.723 7.17877 175.216 7.83332C174.717 8.48787 173.978 8.88869 173 9.03578L176.04 14.1104C176.262 14.5001 176.183 14.8164 175.805 15.0591ZM167.819 7.71197H172.155C173.032 7.71197 173.664 7.5134 174.049 7.11626C174.435 6.71177 174.627 6.06089 174.627 5.16365V4.50175C174.627 3.6045 174.435 2.95731 174.049 2.56016C173.664 2.15567 173.032 1.95342 172.155 1.95342H167.819V7.71197Z" fill="#333333"/>
                  <path d="M182.967 15.015C181.711 15.015 180.762 14.7355 180.119 14.1765C179.484 13.6176 179.124 12.7424 179.038 11.551C179.024 11.323 179.077 11.1465 179.199 11.0215C179.32 10.8965 179.488 10.8339 179.702 10.8339C179.916 10.8339 180.077 10.8928 180.184 11.0104C180.298 11.1281 180.369 11.2973 180.398 11.5179C180.448 12.3048 180.665 12.8527 181.051 13.1616C181.436 13.4705 182.075 13.625 182.967 13.625H186.05C187.035 13.625 187.713 13.4338 188.084 13.0513C188.462 12.6615 188.651 11.9665 188.651 10.9663C188.651 9.95141 188.458 9.25274 188.073 8.8703C187.695 8.48052 187.02 8.28562 186.05 8.28562H183.213C181.921 8.28562 180.972 7.97305 180.366 7.34792C179.759 6.71544 179.456 5.7373 179.456 4.41349C179.456 3.08969 179.755 2.1189 180.355 1.50112C180.962 0.87599 181.907 0.563425 183.192 0.563425H186.039C187.217 0.563425 188.105 0.828186 188.705 1.35771C189.311 1.87988 189.657 2.6999 189.743 3.81778C189.764 4.03841 189.715 4.21492 189.593 4.3473C189.472 4.47233 189.301 4.53484 189.079 4.53484C188.872 4.53484 188.712 4.47601 188.598 4.35833C188.483 4.23331 188.416 4.06416 188.394 3.85088C188.337 3.13749 188.13 2.64474 187.773 2.37263C187.417 2.09316 186.839 1.95342 186.039 1.95342H183.192C182.278 1.95342 181.65 2.13361 181.308 2.49397C180.972 2.84699 180.805 3.48683 180.805 4.41349C180.805 5.34015 180.976 5.98735 181.318 6.35507C181.668 6.71544 182.3 6.89562 183.213 6.89562H186.05C187.399 6.89562 188.394 7.22658 189.037 7.88848C189.679 8.54303 190 9.56897 190 10.9663C190 12.3563 189.679 13.3786 189.037 14.0331C188.401 14.6877 187.406 15.015 186.05 15.015H182.967Z" fill="#333333"/>
                </svg>
              </div>
            </li>
          </ul>
        </section>
        <div class="counter about-counter">
          <div class="counter_container">
            <ul class="counter_row">
              <li v-for="achievement in settings">
                <span>{{ achievement.value }}</span>
                <p>{{ achievement.extra }}</p>
              </li>
            </ul>
          </div>
        </div>
        <section class="about_sales sales">
          <div class="sales_header">
            <h3>Отдел продаж</h3>
            <nav class="sales_nav">
              <li class="flex items-center">
                <img src="@img/icons/phone.svg" />
                <a href="tel:+89180259393">8 (918) 025-93-93</a>
              </li>
              <li class="flex items-center">
                <img src="@img/icons/mail.svg" alt="" />
                <a href="mailto:alliance.motors@bk.ru">alliance.motors@bk.ru</a>
              </li>
            </nav>
          </div>
          <div
              v-if="Object.keys(persons.sale).length"
              class="sales_person"
          >
            <ul class="sales_grid">
              <li
                  v-for="person in persons.sale"
                  :key="person.id"
              >
                <span v-if="person.attachment">
                  <img
                      v-if="person.attachment"
                      :src="person.attachment.url"
                      :alt="person.attachment.origin_name"
                  >
                  <h4>{{ person.name }} {{ person.surname }}</h4>
                  <p>{{ person.job }}</p>
                </span>
              </li>
            </ul>

          </div>
          <div class="morePerson">Показать ещё</div>
        </section>
        <section class="about_sales sales">
          <div class="sales_header">
            <h3 class="wrap-text">Отдел кредитования <br class="show767">и страхования</h3>
            <nav class="sales_nav">
              <li class="flex items-center">
                <img src="@img/icons/phone.svg" />
                <a href="tel:+89180259393">8 (918) 025-93-93</a>
              </li>
              <li class="flex items-center">
                <img src="@img/icons/mail.svg" alt="" />
                <a href="mailto:alliance.motors@bk.ru">alliance.motors@bk.ru</a>
              </li>
            </nav>
          </div>
          <div
              v-if="Object.keys(persons.credit).length"
              class="sales_person2"
          >
            <ul class="sales_grid">
              <li
                  v-for="person in persons.credit"
                  :key="person.id"
              >
                <span v-if="person.attachment">
                  <img
                      v-if="person.attachment"
                      :src="person.attachment.url"
                      :alt="person.attachment.origin_name"
                  >
                  <h4>{{ person.name }} {{ person.surname }}</h4>
                  <p>{{ person.job }}</p>
                </span>
              </li>
            </ul>
          </div>
          <div class="morePerson2">Показать ещё</div>
        </section>
        <section class="about_writing writing hidePerson2">
          <div class="writing_container">
            <div class="writing_text">
              <h1>Уважаемые клиенты!</h1>
              <p>Здесь вы можете оставить отзывы, предложения и пожелания к работе компании «Альянс Моторс», а также ее сотрудников</p>
              <button type="button" class="primary-btn">Письмо директору</button>
            </div>
            <div class="writing_img">
              <img src="@img/card-with-red-envelope.png">
            </div>
          </div>
        </section>
        <section
            class="about_vakancies vakancies hidePerson2"
            v-if="vacancies.length"
        >
          <h1 class="vakancies_title">ВАКАНСИИ</h1>
          <div class="vakancies_block">
            <ul class="vakancies_list">
              <li
                  v-for="vacancy in vacancies"
                  :key="vacancy.id"
              >
                <div class="vakancies-item" :class="{'__active' : active}">
                  <div class="vakancies-item_text">
                    <h1>{{ vacancy.title }}</h1>
                    <span>
              {{ vacancy.min }} - {{ vacancy.max }} ₽
            </span>
                  </div>
                  <div class="vakancies-item_arrow">
                    <button class="splide_my-btn-next vakancies_arrow" @click="active=!active"></button>
                  </div>
                </div>

                <div class="vakancies-item_text_show" :class="{'__active' : active}">
                  {{ vacancy.description }}
                  <br>
                  <br>
                  <b>Требования:</b><br>
                  <p v-for="requirement in vacancy.requirements.split('||')">
                    - {{ requirement }}
                  </p>
                  <br>
                  <b>Условия:</b><br>
                  <p v-for="condition in vacancy.conditions.split('||')">
                    - {{ condition }}
                  </p>
                  <br>
                  <br>
                  <b>Контакты для связи:</b><br>
                  Телефон: <span><a href="tel:+78612054986">+7 (861) 205-49-86</a></span><br>
                  E-mail: <span><a href="mailto:alliance.motors@bk.ru">alliance.motors@bk.ru</a></span>
                </div>
              </li>
            </ul>
          </div>
        </section>
      </section>
    </div>
  </main>

  <div class="popup" id="win">
    <div class="popup__body">
      <div class="popup__content deletePadding">
        <div class="submit">
          <div class="submit_container">
            <div class="flex justify-between items-center">
              <h1 class="submit_title">Заявка успешно отправлена</h1>
              <a href="#header" class="close-popup close-modal">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M30 10L10 30" stroke="white" stroke-width="1.1" stroke-linecap="round" stroke-linejoin="round"/>
                  <path d="M10 10L30 30" stroke="white" stroke-width="1.1" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
              </a>
            </div>
            <p class="wait">Наш специалист вскоре с вами свяжется</p>
          </div>
        </div>
      </div>
    </div>
  </div>

  <div class="popup" id="submit-application">
    <div class="popup__body">
      <div class="popup__content deletePadding">
        <div class="submit">
          <div class="submit_container">
            <div class="flex justify-between items-center">
              <h1 class="submit_title">Оставить заявку</h1>
              <a href="#header" class="close-popup close-modal">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M30 10L10 30" stroke="white" stroke-width="1.1" stroke-linecap="round" stroke-linejoin="round"/>
                  <path d="M10 10L30 30" stroke="white" stroke-width="1.1" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
              </a>
            </div>
            <form class="submit_form" id="submit">
              <input required type="text" id="name" minlength="2" placeholder="Имя" class="input-1"/>
              <input required type="tel" id="tel" placeholder="+7 (___) ___-__-__" class="input-2"/>
              <a href="#win" class="btn-link popup-link w-100">
                <button type="submit" class="btn zayavka-btn w-100 submitRequiredForm">Отправить</button>
              </a>
            </form>
            <p>Нажимая на кнопку “Отправить”, вы даете согласие на обработку перс. данных</p>
          </div>
        </div>
      </div>
    </div>
  </div>

  <a href="#submit-application" class="btn-link full575 show992 popup-link" data-da="menu_body,5,992">
    <button type="submit" class="btn zayavka-btn full575">Оставить заявку</button>
  </a>
</template>

<style scoped>
.__active {
  padding: 1rem 24px;
  max-height: 580px;
}
</style>