<?php

return [
    'breadcrumbs' => [
        'list' => 'Оффисы',
        'edit' => 'Изменение',
        'create' => 'Добавление',
    ],
    'page' => [
        'list' => [
            'name' => 'Список офисов',
            'description' => 'Здесь можно добавить или управлять офисами',
        ],
        'form' => [
            'edit' => [
                'name' => 'Редактируем',
            ],
            'new' => [
                'name' => 'Добавить офис'
            ],
        ],
        'button' => [
            'save' => 'Сохранить',
            'remove' => 'Удалить',
        ],
    ],
    'form' => [
        'address' => [
            'title' => 'Адресс офиса',
            'placeholder' => 'Введите адресс',
        ],
        'tel' => [
            'title' => 'Номер телефона',
        ],
        'geo' => [
            'title' => 'Координаты',
        ],
        'email' => [
            'title' => 'Email',
        ],
        'active' => [
            'title' => 'Активен',
        ],
    ],
    'list' => [
        'tel' => [
            'label' => '',
        ],
        'email' => [
            'label' => 'Email',
        ],
        'active' => [
            'label' => 'Активен',
        ],
        'button' => [
            'on' => [
                'label' => 'Активировать',
                'confirm' => 'Вы собираетесь активировать офис',
            ],
            'off' => [
                'label' => 'Отключение',
                'confirm' => 'Вы собираетесь отключить офис',
            ],
        ],
    ]
];
